Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཏིང་ངེ་འཛིན་དག་དང་། དེ་དག་གི་བྱེད་པ་རྣམས་ཀྱང་ཀུན་བརྟགས་པའི་བདག་ཉིད་ཀྱི་ས་ནི་ཡོད་ཀྱི་ཀུན་བརྟགས་པའི་མཚན་ཉིད་སྤངས་ན་མི་དམིགས་ཏེ། དེའི་ཕྱིར་ཇི་ལྟར་རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then, because the meditative stabilizations and their functions exist with a falsely imagined nature but cannot be apprehended when the marks of the falsely imagined have been eliminated, Subhūti therefore says, “They do not mentally construct them.”

source: །དེ་ནས་བདག་གི་བསམ་པ་བསལ་བར་བྱ་བའི་ཕྱིར། ཆོས་ཐམས་ཅད་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then, to eliminate the thought of “mine,” it says “because all phenomena do not exist.”

source: །འདི་ལྟར་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་བསྟན་པ་ཞེས་བྱ་བ་ལ་ཉོན་མོངས་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་ལ་བྱ་སྟེ།
en: Thus, take the “conflict” in “taught to be the foremost of śrāvakas at the conflict-free stage” as conceptualization.

source: རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བ་རྣམ་པར་མི་རྟོག་པ་ལ་སྙོམས་པར་འཇུག་པ་ནི་ཉོན་མོངས་པ་མེད་པ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་སྟེ།
en: Freedom from all thought construction, absorption into the nonconceptual, is absorption into “the conflict-free.”

source: དེ་བས་ན་རྣམ་པར་མི་རྟོག་པ་ཉིད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: Hence the Lord confers an “excellent!” on the nonconceptual state.

source: །དེ་ལྟར་ཏིང་ངེ་འཛིན་ལ་བསླབ་པ་བསྟན་ནས་དམིགས་སུ་མེད་པར་བསླབ་པ་བསྟན་པའི་ཕྱིར། ཤཱ་རིའི་བུ་དེ་ལྟར་སློབ་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Training in not apprehending all dharmas Having thus given an exposition of the training in meditative stabilization, to teach training in not apprehending it says, “Śāriputra… training like that… up to they train in the eighteen distinct attributes of a buddha, by way of not apprehending anything,” and so on.

source: །དམིགས་སུ་མེད་པར་བསླབ་པ་བསྟན་པའི་ཕྱིར། ཤཱ་རིའི་བུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་བདག་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་གང་ཟག་མི་དམིགས་པར་བསྟན་ནས།
en: To teach training in not apprehending, it gives an exposition of not apprehending persons with, “Śāriputra, because of the state of absolute purity they do not apprehend a self,” and so on.

source: དེའི་འོག་ཏུ་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ལ་སོགས་པའི་ཆོས་རྣམས་དམིགས་སུ་མེད་པ་བསྟན་ཏེ། རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ནས་སངས་རྒྱས་ཀྱི་བར་དུ་མི་དམིགས་པ་བསྟན་ཏོ།
en: It then gives an exposition of not apprehending all dharmas, with “aggregates, constituents, sense fields,” and so on, teaching “they do not apprehend a stream enterer,” and so on, up to “a buddha.”

source: །ཐམས་ཅད་ལ་ཡང་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་མཐར་ཕྱིན་པའི་རྣམ་པར་དག་པའི་རྒྱུར་གྱུར་པ་ཉེ་བར་བཟུང་ནས་དེའི་ངོ་བོ་ཉིད་ཞུ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་གང་ལགས་ཞེས་བྱ་བ་ཞུས་པ་དང་དེ་ནས་ཡོངས་སུ་གྲུབ་པ་དྲི་མ་མེད་པ་དེ་བཞིན་ཉིད་ལ་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་བསྟན་པའི་ཕྱིར། ཤཱ་རིའི་བུ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་།
en: As for “because of the state of absolute purity” they all have, having taken the completion of purification to be serving as a cause, in order to inquire about its intrinsic nature he asks, “Lord, what is purity?”

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ནི་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: The Lord, to teach that the stainless, thoroughly established suchness is purity, says, “Śāriputra, not being produced, not stopping, not being defilement, not being purification, not appearing, not being apprehended, and not occasioning anything is called the purity of all dharmas.”

source: སྔོན་དེ་བཞིན་ཉིད་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ནི་ཀུན་བརྟགས་པས་ཆོས་རྣམས་སྐྱེ་བ་དང་། འགག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: Earlier, during the period when suchness has stains, all dharmas are produced and stop, are defiled and purified as falsely imagined phenomena.

source: རྣམ་པར་བྱང་བར་འགྱུར་ཏེ་སྐྱེས་པ་རྣམས་འབྱུང་ཞིང་བྱུང་ནས་ཀྱང་དེ་ལྟ་དེ་ལྟར་དམིགས་པར་འགྱུར་ལ།
en: The produced comes into being and, having come into being, it is apprehended like this and like that, occasioning things like this and like that.

source: དེ་ལྟ་དེ་ལྟར་མངོན་པར་འདུ་བྱེད་པར་འགྱུར་རོ། །དྲི་མ་མེད་པའི་གནས་སྐབས་ན་ནི་དེ་བཞིན་ཉིད་དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་ཐམས་ཅད་མེད་དེ།
en: During the period when there are no stains, in each and every way, the production of all dharmas in that suchness is nonexistent.

source: སྐྱེ་བ་མེད་པས་འགག་པ་ཡང་མེད་དོ། །དྲི་མ་མེད་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་རྣམ་པར་བྱང་བ་མེད་པ་དང་འབྱུང་བ་མེད་པར་འགྱུར་རོ། །འབྱུང་བ་མེད་པས་དམིགས་སུ་མེད་དོ། །དམིགས་སུ་མེད་པའི་ཕྱིར་མངོན་པར་འདུ་བྱེད་པ་མེད་དེ།
en: Because there is no production, there is no stopping; because there are no stains there is no defilement, no purification, and no appearing; because there is no appearing there is no apprehending; and because there is no apprehending, there is not occasioning anything.

source: འདི་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱའོ།
en: This is called “absolute purity.” “

source: །ཆོས་གང་ལ་ཡང་སློབ་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་དེ་དྲི་མ་མེད་པའི་གནས་སྐབས་ན་ཆོས་ཐམས་ཅད་མ་མཐོང་བའི་ཕྱིར་ཆོས་འདི་དག་ནི་དེ་ལྟ་བུར་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Do not train in any dharma”— because bodhisattvas do not see all dharmas during the period when there are no stains, it says “those dharmas do not exist in the way foolish, ordinary people take them to be.”

source: །ཀུན་བརྟགས་པའི་མཚན་ཉིད་དུ་ཡོད་པ་མ་ཡིན་པར་བསྟན་པའི་ཕྱིར། ཤཱ་རིའི་བུ་ཇི་ལྟར་མེད་པ་དེ་ལྟར་ཡོད་དོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: To teach that marked as being falsely imagined they are nonexistent it says, “Śāriputra, as they do not exist, so do they exist.”

source: །ཀུན་བརྟགས་པའི་དངོས་པོ་མེད་པའི་རྣམ་པ་བརྗོད་དུ་མེད་པའི་བདག་ཉིད་དུ་ཡོད་པར་བསྟན་པའི་ཕྱིར་དེ་ལྟར་ཡོད་པ་མ་ཡིན་པས་དེའི་ཕྱིར་མ་རིག་པ་ཞེས་བྱའོ་ཞེས་གསུངས་ཏེ།
en: To teach that they exist in the inexpressible form of a falsely imagined thing that does not exist it says, “Thus, they do not exist, so one says ignorance.”

source: རྨི་ལམ་གྱི་རྣམ་པར་ཤེས་པ་བཞིན་དུ་བདག་ཉིད་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་མ་ཡིན་པའི་ཕྱིར་མེད་བཞིན་དུ་ཡོད་པ་མ་ཡིན་པའི་དོན་གཞན་དག་ལ་ཡང་འཛིན་པར་བྱེད་དོ།
en: This means that like dream consciousness it is not in its nature a state of perfect reality. Even while not there, it causes grasping at other things that do not exist.

source: །ཡང་ན་ཡང་དག་པར་མ་རིག་པ་སྟེ། ཡང་དག་པ་མ་ཡིན་པར་རིག་ཅིང་ཤེས་པར་བྱེད་པ་ནི་མ་རིག་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Alternatively, it does not know perfectly, which is to say, it causes imperfect knowledge and understanding, hence it is “ignorance.”

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་མཆིས་པ་མ་ལགས་པ་ལ་མ་རིག་པ་ཞེས་བགྱི་ཞེས་ཞུས་པ་དང་།
en: Śāriputra asks, “Lord why are the nonexistent called ignorance?”

source: ཤཱ་རིའི་བུ་གཟུགས་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ། །དགོངས་པ་ནི་འདི་ལྟ་སྟེ། འདི་ལྟར་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མེད་ཅིང་ཡང་དག་པ་མ་ཡིན་པ་ཡང་།
en: and it says, “Śāriputra, form does not exist,” and so on.

source: ཡང་དག་ཡོད་པ་བཞིན་དུ་འཛིན་ཏེ་དེའི་ཕྱིར། དེ་ཡང་དག་པར་མ་རིག་པ་སྟེ།
en: Here is what it intends: even though dharmas are thus nonexistent and unreal, they are grasped as if they really exist, so they are not known perfectly, which is to say are not understood perfectly, so it is “ignorance.”

source: ཡང་དག་པར་མ་ཤེས་པས་མ་རིག་པ་ཞེས་བྱའོ་ཞེས་བསྟན་པའི་ཕྱིར་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་བཀའ་སྩལ་ཏོ།
en: To teach that, the Lord says the dharmas, “form” and so on, do not exist.

source: །དོན་འདི་ཉིད་གསལ་བར་བྱ་བའི་ཕྱིར། དེ་ལ་བྱིས་པ་རྣམས་མ་རིག་པ་དང་། སྲེད་པ་དག་གིས་མངོན་པར་ཞེན་ནས་མཐའ་གཉིས་ལ་ཆགས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To make just this meaning clear it says, “Those foolish people [who] settle down on them because of ignorance and craving… are attached to the two extremes.”

source: མ་རིག་པའི་དབང་གིས་ཡོད་པའི་རྣམ་པར་མངོན་པར་ཞེན་ནས་སྲེད་པའི་དབང་གིས་རོ་མྱང་བར་བྱ་བའི་སྒོ་ནས་མངོན་པར་ཞེན་ཏེ། རྟག་པ་དང་ཆད་པའི་མཐའ་གཉིས་ལ་ཆགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means having settled down on the aspect of existence through the power of ignorance and having settled down by way of relishing the experience through the power of craving, they become “attached to the two extremes,” “permanence and annihilation.” “

source: །དེ་དག་མི་ཤེས་མི་མཐོང་ཞེས་བྱ་བ་ནི་རྗེས་སུ་དཔག་པའམ། མངོན་སུམ་མམ། ཡང་ན་ལུང་གི་མཐུའམ། རང་གི་མཐུས་མི་ཤེས་པའོ།
en: They do not know, and they do not see”— that is to say, they do not understand with inferential or direct perception, or else on account of the force of scripture or the force of their own personality.

source: །འདི་ལ་འགྲེས་གསུམ་སྟེ། མ་རིག་པའི་རྩ་བ་ལས་བྱུང་བ་དང་། རྟོག་པའི་རྩ་བ་ལས་བྱུང་བ་དང་། མ་དད་པའི་རྩ་བ་ལས་བྱུང་བའོ།
en: This is in three parts, where it lists the dharmas in the context of explaining: they have come about rooted in ignorance, they have come about rooted in thought construction, and they have come about rooted in the absence of faith.

source: །དེ་ལ་མ་རིག་པའི་དབང་གིས་ནི་མེད་པའི་ཆོས་རྣམས་ལ་ཡོད་པར་བཟུང་ནས་སྲེད་པས་རོ་མྱོང་བར་བྱེད་པའི་དབང་གིས་མཐའ་གཉིས་སུ་ལྷུང་བའི་བྱིས་པ་རྣམས་ཀྱིས་མི་ཤེས་མ་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་འགྲེས་དང་པོའོ།
en: There, the first section explains that having grasped dharmas as existing where they do not exist because of the power of ignorance, and through the power of relishing the experience because of craving, having fallen into the two extremes, fools “do not know and do not see.”

source: །དེ་ལྟར་ཤེས་པ་དང་།
en: The second section explains they thus do not know and see, therefore mental constructions multiply.

source: མཐོང་བ་མེད་པས་རྟོག་པ་མང་དུ་གྱུར་ཏེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མ་ཡིན་པས་རྟོག་ཅིང་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་ནས། མཐའ་གཉིས་སུ་རྟོག་པའི་ཕྱིར་མི་ཤེས་མི་མཐོང་ངོ་།
en: Mentally constructing dharmas not for what they are and settling down on them, mentally constructing them at the two extremes, they “do not know and do not see.”

source: །དེ་དག་ཆོས་ཐམས་ཅད་མི་ཤེས་མི་མཐོང་བས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་སྟེ་ངེས་པར་འབྱུང་བ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་འགྲེས་གཉིས་པའོ།
en: Because they do not know and see all dharmas “they are, therefore, counted as fools. They will not definitely emerge.”

source: །དེ་བཞིན་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐོས་ཀྱང་དོན་དེ་ལ་མ་དད་པས་དང་བ་ལ་གནས་པ་མེད་པའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒྲུབ་པ་ལ་མི་གནས་སོ། །སྒྲུབ་པ་ལ་མི་གནས་པས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ལ་སོགས་པ་རྟོགས་པར་བྱ་བའི་ཆོས་རྣམས་མི་འཐོབ་སྟེ།
en: The third section similarly explains that even though they have heard about them for what they really are, “they do not place their faith” in that reality, so, because they do not abide in serene confidence “they do not rest” in the perfections; and because they do not rest in the practice they do not attain the dharmas to be realized, such as becoming irreversible from awakening and so on.

source: དེ་བས་ན་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པའི་སྐྱོན་གྱིས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ་ཞེས་བྱ་བ་ནི་འགྲེས་གསུམ་པའོ།
en: So “they are, therefore, counted as fools,” as ordinary people, because of the fault of settling down on all dharmas.

source: །དེ་ལྟར་གྱུར་པ་དེ་དག་ལ་སློབ་པ་དང་། ངེས་པར་འབྱུང་བ་ཡང་མེད་དོ་ཞེས་བསྟན་ནས་ཅིའི་ཕྱིར་སློབ་པ་དང་། ངེས་པར་འབྱུང་བ་མེད་ཅེས་ཞུས་པ་དང་།
en: Having been taught that those like that do not train in them and do not go forth, there is the question, “Why… do they… not train… and not go forth?”

source: གང་གི་ཕྱིར་ཐབས་མི་མཁས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྒྲུབ་པའི་ཆོས་རྣམས་ལ་རྟོག་ཅིང་མངོན་པར་ཞེན་པར་བྱེད་པ་དེའི་ཕྱིར་སློབ་པ་མེད་དོ། །གང་གི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་སོགས་པ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དག་ལ་རྟོག་ཅིང་མངོན་པར་ཞེན་པ་དེའི་ཕྱིར་ངེས་པར་འབྱུང་བ་མེད་དོ་ཞེས་བསྟན་ནས།
en: And it says they “do not train” because “without skillful means they mentally construct and settle down on” all the perfections and all the practice dharmas; and they “do not go forth” because they mentally construct and settle down on the dharmas on the side of awakening and so on, up to “the knowledge of all aspects.”

source: དེ་ནས་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དག་ཉིད་ལ་སྒྲུབ་པའི་ཆོས་རྣམས་མི་དམིགས་པར་སློབ་པ་ལ་ཞུགས་པའི་མིང་དུ་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ཆོས་རྣམས་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པ་ཉིད་ངེས་པར་འབྱུང་བ་ཡིན་ནོ་ཞེས་བྱ་བས། དམིགས་སུ་མེད་པར་སློབ་པ་བསྟན་ནས།
en: It also says that practicing those same perfections without apprehending all dharmas is named having entered into the training, and not apprehending the knowledge of all aspects, and the dharmas, up to, the emptiness of all dharmas is going forth.

source: ཡང་སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པར་སློབ་པ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལ་ལ་ཞིག་འདི་སྐད་དུ་འདྲི་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Training in the illusion-like Having thus explained the training in not apprehending all dharmas, to teach training in the illusion-like and so on, it says, “Lord, suppose someone were to ask,” and so on.

source: །འདི་ལ་ཡང་གནས་བརྟན་རབ་འབྱོར་གྱི་དགོངས་པ་ནི་འདི་ཡིན་ཏེ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དམིགས་སུ་མ་མཆིས་པར་སྦྱོར་བས། ཆོས་རྣམས་དངོས་པོ་མ་མཆིས་པས།
en: Here this is what venerable Subhūti is thinking: “Lord, if they practice without apprehending anything then there are no dharmas.

source: དངོས་པོ་མ་མཆིས་པའི་ཆོས་རྣམས་ལ་བསླབས་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ན་ནི། འོ་ན་ནི་ཤིན་ཏུ་མ་མཆིས་པའི་སྒྱུ་མའི་སྐྱེས་བུས་ཀྱང་། སྒྱུ་མར་བགྱིས་པ་རྣམས་ལ་དམིགས་སུ་མ་མཆིས་པའི་ཡིད་ལ་བགྱིད་པས་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཞིང་། རྗེས་སུ་ཐོབ་པར་འགྱུར་རོ་སྙམ་པའོ།
en: And were they to go forth having trained in dharmas that do not exist, well then, even a totally nonexistent illusory person acting out an illusion with illusory attention that cannot be apprehended would, having trained, go forth and accomplish the knowledge of all aspects.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མའི་ཆོས་རྣམས་དང་། གཟུགས་ལ་སོགས་པ་ཐ་དད་པ་ནི་ཅི་ཡང་མེད་དེ། ཇི་ལྟར་སྒྱུ་མའི་ཆོས་རྣམས་ལ་བསླབ་པའམ། ངེས་པར་འབྱུང་བ་མེད་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་བསླབ་པའམ། དེ་དག་ལ་ངེས་པར་འབྱུང་བའམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ངེས་པར་ཐོབ་པར་འགྱུར་བ་མེད་དོ།
en: Then, in the first section explaining illusion, the Lord says: Just as there is no training in, or going forth to, illusory dharmas, similarly for bodhisattvas there is no training in the dharmas, form and so on, or going forth to them, or definitely reaching the knowledge of all aspects.

source: །སྒྱུ་མ་དང་མཚུངས་པར་བསྟན་པའི་ཕྱིར། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: To teach that they are like an illusion he asks, “Subhūti, what do you think about this: Is illusion one thing and form another?”

source: སྒྱུ་མ་ཡང་གཞན་ལ།
en: and so on.

source: གཟུགས་ཀྱང་གཞན་ཞིག་ཡིན་སྙམ་མམ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་སུ་མེད་པར་མཐོང་བ་དག་གིས་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་སྒྱུ་མ་ལས་ལོགས་ཤིག་ན་ཡོད་པར་མ་མཐོང་སྟེ། དེ་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་སྒྱུ་མ་ཡང་གཞན་མ་ལགས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་མ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་གཞུང་གིས་གསུངས་ཏེ།
en: And to teach that bodhisattvas skilled in the nonexistence of an intrinsic nature, who see that all dharmas cannot be apprehended, do not see falsely imagined dharmas like form and so on as existing apart from being illusions, there is the passage that ends, “Illusion is not one thing, Lord, and the knowledge of all aspects another; the knowledge of all aspects is itself illusion, Lord, and illusion is itself the knowledge of all aspects.”

source: ཐམས་ཅད་ཀྱང་ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་སྒྱུ་མ་དང་ཐ་དད་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་སྒྱུ་མའི་འགྲེས་དང་པོའོ། །དེ་བཞིན་དུ་སྐྱེ་བ་དང་། འགག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: It is saying that because all are in their intrinsic nature falsely imagined, they are, as the nonexistence of an intrinsic nature, undifferentiable from illusions.

source: རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཤིན་ཏུ་མེད་པའི་སྒྱུ་མ་དང་། ཆོས་ཐམས་ཅད་ལ་བསླབ་པ་དང་། ངེས་པར་འབྱུང་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་སྒྱུ་མའི་འགྲེས་གཉིས་པའོ། །གལ་ཏེ་ཕུང་པོ་ལ་སོགས་པ་མ་འདྲེས་པའི་ཆོས་རྣམས་ལ་ཐུག་པའི་བར་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་དུ་མི་བརྗོད་ན།
en: Similarly, the second section explaining illusion says that because “production… stopping… defilement and purification” do not exist there is no training in all illusions and dharmas that absolutely do not exist, no going forth, and no reaching the knowledge of all aspects.

source: དེ་ལྟ་ན་ནི་སྒྱུ་མའི་སྐྱེས་བུ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མེད་དོ། །ཕུང་པོ་ལ་སོགས་པ་མ་འདྲེས་པའི་མཐའ་ལ་ཐུག་པའི་བར་གྱི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་དང་། འགག་པ་ལ་སོགས་པ་མེད་པའི་ཕྱིར་སྒྱུ་མ་བཞིན་དུ་མེད་པ་ཉིད་དོ། །དེ་ལྟ་ན་ནི་འདུ་ཤེས་དང་བརྡ་ལ་སོགས་པ་མེད་པ་དང་། ཤིན་ཏུ་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་མེད་པའི་ཆོས་རྣམས་ལ་ཇི་ལྟར་སློབ།
en: Then it teaches that if the name bodhisattva is not said relative to the aggregates and so on, up to the distinct attributes, in that case, just like an illusory person, a bodhisattva does not exist; and because there is no production, stopping, and so on of the dharmas—from the aggregates and so on, up to the distinct attributes—they too, like illusions, do not exist, and names, conventional terms, and so on do not exist either, so how can totally nonexistent bodhisattvas train in totally nonexistent dharmas?

source: ཇི་ལྟར་ངེས་པར་འབྱུང་།
en: How can they go forth, and how can they reach the knowledge of all aspects?

source: ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་ཞེས་བསྟན་ནས་དེ་ལྟར་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་དེ་ནི་ངེས་པར་འབྱུང་ཞིང་ཐོབ་པར་འགྱུར་རོ་ཞེས་མཇུག་བསྡུས་སོ།
en: Then in conclusion it says that when they “train… like that, by way of not apprehending anything, they go forth to the knowledge of all aspects and reach the knowledge of all aspects.”

source: །དེ་ལྟར་ཕུང་པོ་ལྔ་པོ་དེ་དག་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར། རྨི་ལམ་དང་། བྲག་ཅ་དང་། མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་ཡིན་ལ། སྐྱེ་མཆེད་དྲུག་ཀྱང་དེ་དག་ཉིད་ཡིན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ནི་གང་ཡང་མེད་དེ།
en: Thus, because of the nonexistence that is their intrinsic nature, those five aggregates are like a dream… an echo… an apparition… a reflection in a mirror… a magical creation… and a mirage, and because of just that the six sense fields are too, so a “bodhisattva” does not exist at all, because of the emptiness that is the nonexistence of its intrinsic nature.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་སོགས་པའི་ཕྱིར་རོ། །དེ་ལྟར་སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པར་བསླབ་པ་བསྟན་ནས། ཡང་ཐབས་མཁས་པ་ལ་སྒྲུབ་པའི་སྐབས་དབྱེ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས་བསྟན་པ་འདི་ཐོས་ནས་སྐྲག་སྟེ་དངང་ཤིང་དངང་བར་མི་འགྱུར་ལགས་གྲང་ཞེས་བྱ་བ་བསྟན་ནས།
en: Training in skillful means Having thus taught the training in the illusion-like and so on, to set the scene for training in skillful means it says, “Lord, if bodhisattva great beings who have newly set out in the vehicle were to hear this exposition would they not tremble, feel frightened, and become terrified?”

source: ཐབས་མི་མཁས་ལ་དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་ཡང་མ་སོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ལྟར་སྐྲག་སྟེ་དངང་བར་འགྱུར་གྱི། ཐབས་ལ་མཁས་པ་གང་ཡིན་པ་དེ་ནི་སྐྲག་ཅིང་དངང་བར་མི་འགྱུར་རོ་ཞེས་བསྟན་པ་དང་།
en: And then it explains that “those without skillful means who have not been taken in hand by a spiritual friend, they will tremble, feel frightened, and become terrified, but those with skillful means will not tremble and become terrified.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་གང་གིས་བསྟན་པ་འདི་ཐོས་ན་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་བའི་ཐབས་མཁས་པ་གང་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པས་ཐབས་ལ་མཁས་པ་བསྟན་ཏོ།
en: And it says, “Lord, what skillful means do bodhisattva great beings who have newly set out in the vehicle have not to tremble, feel frightened, and become terrified when they hear this exposition?” Thus, it gives an exposition of skillful means.

source: །སྐྲག་པ་དང་། དངང་བ་ལ་སོགས་པའི་དོན་ནི་སྔར་བསྟན་ཟིན་ཏོ།
en: I have explained the meaning of “tremble, feel frightened” and so on before.

source: །ཐབས་ལ་མཁས་པ་དེ་ཡང་རྣམ་པ་བཞིར་བསྟན་ཏེ། ཆོས་ཐམས་ཅད་ལ་སོ་སོར་རྟོག་པའི་ཐབས་ལ་མཁས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཐབས་ལ་མཁས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པའི་ཐབས་ལ་མཁས་པ་དང་། སྡིག་པའི་གྲོགས་པོ་སྤང་བའི་ཐབས་ལ་མཁས་པའོ།
en: Those skillful means are also explained in four parts: skillful means of the analytic understanding of all dharmas,skillful means of completing the six perfections,skillful means of relying on a spiritual friend, andskillful means of shunning a bad friend.

source: །དེ་ལ་གཟུགས་མི་རྟག་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ་དེ་ཡང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་སོ་སོར་རྟོག་པའི་ཐབས་ལ་མཁས་པ་བསྟན་ཏོ།
en: Among these, starting from “[they] analytically understand about form its impermanent aspect, but do not apprehend it,” up to “you should know that this is the skillful means of bodhisattva great beings practicing the perfection of wisdom,” teaches the skillful means of the analytic understanding of all dharmas.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པས་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པའོ་ཞེས་བྱ་བའི་བར་གྱིས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཐབས་ལ་མཁས་པ་བསྟན་ཏོ། །དེ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་འཆད་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: Starting from, “Furthermore, Subhūti, bodhisattva great beings practicing the perfection of wisdom with attention connected with the knowledge of all aspects,” up to “Subhūti, you should know that this is the skillful means of bodhisattva great beings practicing the perfection of wisdom,” teaches the skillful means of completing the six perfections.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་ཡོངས་སུ་སྤོང་བ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །ཆོས་ཟབ་མོ་ལ་བཟོད་ཅིང་མོས་པ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །མི་དམིགས་པའི་ཡིད་ལ་བྱེད་པས་སོ་སོར་རྟོག་པ་མི་གཏོང་བ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །བྱང་ཆུབ་ཀྱི་བར་དུ་གཅོད་པར་བྱེད་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཀྱི་གོ་སྐབས་མི་འབྱེད་པ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: Among them, giving expositions of Dharma by way of not apprehending anything is the perfection of giving; stopping śrāvaka and pratyekabuddha thoughts by way of not apprehending anything is the perfection of morality; forbearance and admiration for the deep dharmas is the perfection of patience; paying attention to not apprehending anything and not giving up analytic understanding is the perfection of perseverance; not providing an opportunity for unwholesome dharmas that are impediments to awakening is the perfection of concentration; and the analytic understanding of emptiness is the perfection of wisdom. “

source: །སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ཀྱི་རྒྱུས་གློ་བུར་དུ་སྟོང་པར་གྱུར་པ་མ་ཡིན་ཏེ།
en: Form is not empty because of the emptiness of form”— the true dharmic nature of “form” does “not” become “empty” out of thin air “because of” being caused by “the emptiness of” falsely imagined “form,” because it is empty of an intrinsic nature.

source: ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །དེ་བས་ན་གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “form is itself emptiness, emptiness is itself form.”

source: སྟོང་པ་ཉིད་དང་ཆོས་ཉིད་ཀྱི་གཟུགས་དག་ངོ་བོ་ཉིད་གཅིག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means emptiness and the true dharmic nature of form are the same intrinsic nature.

source: །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། རབ་འབྱོར་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ཏེ།
en: Starting from, “Subhūti, the spiritual friends of bodhisattva great beings,” up to “they, Subhūti, are the spiritual friends of bodhisattva great beings.
